<a href="https://colab.research.google.com/github/bmt21411/bmt_python/blob/main/21411_10%EC%A3%BC%EC%B0%A8%EC%8B%A4%EC%8A%B5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [10]:
row = pd.date_range('20210507' , periods=6)
col = list('ABCD')
df=pd.DataFrame(np.random.randn(6,4), index=row, columns=col)

In [11]:
df

                   A         B         C         D
2021-05-07 -1.380078 -1.387744  0.017087  0.243960
2021-05-08 -1.677953 -1.115377  0.497799  2.265493
2021-05-09  0.342399  2.569590  0.574165  0.350223
2021-05-10 -0.583187  0.162252 -0.241163 -1.238576
2021-05-11 -1.200548  0.100165 -0.136948  0.898597
2021-05-12 -0.729848 -0.172444 -0.314325  1.790685

In [12]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20210507', periods=6))

In [13]:
df['F'] = s1

In [14]:
df

                   A         B         C         D   F
2021-05-07 -1.380078 -1.387744  0.017087  0.243960 NaN
2021-05-08 -1.677953 -1.115377  0.497799  2.265493 NaN
2021-05-09  0.342399  2.569590  0.574165  0.350223 NaN
2021-05-10 -0.583187  0.162252 -0.241163 -1.238576 NaN
2021-05-11 -1.200548  0.100165 -0.136948  0.898597 NaN
2021-05-12 -0.729848 -0.172444 -0.314325  1.790685 NaN

In [15]:
df>0

                A      B      C      D      F
2021-05-07  False  False   True   True  False
2021-05-08  False  False   True   True  False
2021-05-09   True   True   True   True  False
2021-05-10  False   True  False  False  False
2021-05-11  False   True  False   True  False
2021-05-12  False  False  False   True  False

In [16]:
df[df>0]

                   A         B         C         D   F
2021-05-07       NaN       NaN  0.017087  0.243960 NaN
2021-05-08       NaN       NaN  0.497799  2.265493 NaN
2021-05-09  0.342399  2.569590  0.574165  0.350223 NaN
2021-05-10       NaN  0.162252       NaN       NaN NaN
2021-05-11       NaN  0.100165       NaN  0.898597 NaN
2021-05-12       NaN       NaN       NaN  1.790685 NaN

In [41]:
df2=df

In [42]:
df2=df.copy()

In [43]:
df2[df2>0]

                   A         B         C         D   F
2021-05-07       NaN       NaN  0.017087  0.243960 NaN
2021-05-08       NaN       NaN  0.497799  2.265493 NaN
2021-05-09  0.342399  2.569590  0.574165  0.350223 NaN
2021-05-10       NaN  0.162252       NaN       NaN NaN
2021-05-11       NaN  0.100165       NaN  0.898597 NaN
2021-05-12       NaN       NaN       NaN  1.790685 NaN

In [44]:
df2[df2>0] = -df

In [45]:
df2

                   A         B         C         D   F
2021-05-07 -1.380078 -1.387744 -0.017087 -0.243960 NaN
2021-05-08 -1.677953 -1.115377 -0.497799 -2.265493 NaN
2021-05-09 -0.342399 -2.569590 -0.574165 -0.350223 NaN
2021-05-10 -0.583187 -0.162252 -0.241163 -1.238576 NaN
2021-05-11 -1.200548 -0.100165 -0.136948 -0.898597 NaN
2021-05-12 -0.729848 -0.172444 -0.314325 -1.790685 NaN

In [46]:
df

                   A         B         C         D   F
2021-05-07 -1.380078 -1.387744  0.017087  0.243960 NaN
2021-05-08 -1.677953 -1.115377  0.497799  2.265493 NaN
2021-05-09  0.342399  2.569590  0.574165  0.350223 NaN
2021-05-10 -0.583187  0.162252 -0.241163 -1.238576 NaN
2021-05-11 -1.200548  0.100165 -0.136948  0.898597 NaN
2021-05-12 -0.729848 -0.172444 -0.314325  1.790685 NaN

In [47]:
df.mean(0)

A   -0.871536
B    0.026074
C    0.066102
D    0.718397
F         NaN
dtype: float64

In [48]:
df.mean(1)

2021-05-07   -0.626694
2021-05-08   -0.007509
2021-05-09    0.959094
2021-05-10   -0.475169
2021-05-11   -0.084684
2021-05-12    0.143517
Freq: D, dtype: float64

In [49]:
df.apply(np.cumsum)

                   A         B         C         D   F
2021-05-07 -1.380078 -1.387744  0.017087  0.243960 NaN
2021-05-08 -3.058031 -2.503121  0.514886  2.509453 NaN
2021-05-09 -2.715632  0.066469  1.089050  2.859676 NaN
2021-05-10 -3.298819  0.228721  0.847887  1.621100 NaN
2021-05-11 -4.499367  0.328885  0.710939  2.519698 NaN
2021-05-12 -5.229215  0.156442  0.396614  4.310382 NaN

In [50]:
df

                   A         B         C         D   F
2021-05-07 -1.380078 -1.387744  0.017087  0.243960 NaN
2021-05-08 -1.677953 -1.115377  0.497799  2.265493 NaN
2021-05-09  0.342399  2.569590  0.574165  0.350223 NaN
2021-05-10 -0.583187  0.162252 -0.241163 -1.238576 NaN
2021-05-11 -1.200548  0.100165 -0.136948  0.898597 NaN
2021-05-12 -0.729848 -0.172444 -0.314325  1.790685 NaN

In [51]:
df.apply(np.cumsum,axis=1)

                   A         B         C         D   F
2021-05-07 -1.380078 -2.767822 -2.750735 -2.506775 NaN
2021-05-08 -1.677953 -2.793330 -2.295531 -0.030038 NaN
2021-05-09  0.342399  2.911989  3.486154  3.836377 NaN
2021-05-10 -0.583187 -0.420935 -0.662099 -1.900674 NaN
2021-05-11 -1.200548 -1.100384 -1.237332 -0.338734 NaN
2021-05-12 -0.729848 -0.902292 -1.216617  0.574068 NaN

In [52]:
df

                   A         B         C         D   F
2021-05-07 -1.380078 -1.387744  0.017087  0.243960 NaN
2021-05-08 -1.677953 -1.115377  0.497799  2.265493 NaN
2021-05-09  0.342399  2.569590  0.574165  0.350223 NaN
2021-05-10 -0.583187  0.162252 -0.241163 -1.238576 NaN
2021-05-11 -1.200548  0.100165 -0.136948  0.898597 NaN
2021-05-12 -0.729848 -0.172444 -0.314325  1.790685 NaN

In [53]:
lambda df : df.max() - df.min()

In [54]:
print(df)

                   A         B         C         D   F
2021-05-07 -1.380078 -1.387744  0.017087  0.243960 NaN
2021-05-08 -1.677953 -1.115377  0.497799  2.265493 NaN
2021-05-09  0.342399  2.569590  0.574165  0.350223 NaN
2021-05-10 -0.583187  0.162252 -0.241163 -1.238576 NaN
2021-05-11 -1.200548  0.100165 -0.136948  0.898597 NaN
2021-05-12 -0.729848 -0.172444 -0.314325  1.790685 NaN

In [59]:
df.apply(lambda x: x.max() - x.min())

A    2.020353
B    3.957334
C    0.888490
D    3.504069
F         NaN
dtype: float64

In [60]:
df.A.max(), df.A.min()

(0.34239924352117285, -1.6779534383897177)

In [61]:
df

                   A         B         C         D   F
2021-05-07 -1.380078 -1.387744  0.017087  0.243960 NaN
2021-05-08 -1.677953 -1.115377  0.497799  2.265493 NaN
2021-05-09  0.342399  2.569590  0.574165  0.350223 NaN
2021-05-10 -0.583187  0.162252 -0.241163 -1.238576 NaN
2021-05-11 -1.200548  0.100165 -0.136948  0.898597 NaN
2021-05-12 -0.729848 -0.172444 -0.314325  1.790685 NaN

In [68]:
s = pd.Series(np.random.randint(1, 7, size = 6000))
s.value_counts()

4    1046
1    1041
5    1003
2     990
6     969
3     951
dtype: int64

In [69]:
df = pd.DataFrame(np.random.randn(10, 4))

In [71]:
df

          0         1         2         3
0  0.287731 -2.176377  1.894494 -1.078490
1  0.508631  1.247063 -0.086131 -0.832398
2 -0.088929 -0.519552  0.848577 -1.445056
3 -0.156276 -0.809880  0.637898  0.088527
4  0.298651 -0.331621 -0.089957 -0.153282
5  0.669977  1.371539 -1.646348  1.281645
6 -1.504687  0.423892 -0.876855  1.201143
7 -0.248947  0.496421 -0.815897  0.436926
8  1.332622 -1.200830  1.150031  1.033326
9 -1.939894 -0.648896  0.777891  0.814742

In [76]:
pieces = [ df[:3], df[3:7], df[7:] ]
pieces

[          0         1         2         3
 0  0.287731 -2.176377  1.894494 -1.078490
 1  0.508631  1.247063 -0.086131 -0.832398
 2 -0.088929 -0.519552  0.848577 -1.445056,
           0         1         2         3
 3 -0.156276 -0.809880  0.637898  0.088527
 4  0.298651 -0.331621 -0.089957 -0.153282
 5  0.669977  1.371539 -1.646348  1.281645
 6 -1.504687  0.423892 -0.876855  1.201143,
           0         1         2         3
 7 -0.248947  0.496421 -0.815897  0.436926
 8  1.332622 -1.200830  1.150031  1.033326
 9 -1.939894 -0.648896  0.777891  0.814742]

In [77]:
pd.concat(pieces)

          0         1         2         3
0  0.287731 -2.176377  1.894494 -1.078490
1  0.508631  1.247063 -0.086131 -0.832398
2 -0.088929 -0.519552  0.848577 -1.445056
3 -0.156276 -0.809880  0.637898  0.088527
4  0.298651 -0.331621 -0.089957 -0.153282
5  0.669977  1.371539 -1.646348  1.281645
6 -1.504687  0.423892 -0.876855  1.201143
7 -0.248947  0.496421 -0.815897  0.436926
8  1.332622 -1.200830  1.150031  1.033326
9 -1.939894 -0.648896  0.777891  0.814742

In [89]:
left = pd.DataFrame(
    {
        'a':['foo', 'foo'],
        'lval': [1, 2]
     }
)
right = pd.DataFrame({'a':['foo', 'foo'], 'rval': [4, 5]})

In [90]:
left

     a  lval
0  foo     1
1  foo     2

In [91]:
right

     a  rval
0  foo     4
1  foo     5

In [92]:
pd.merge(left, right, on = 'a')

     a  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [93]:
df = pd.DataFrame(
    {
        'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'bar'],
        'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C' : np.random.randn(8),
        'D' : np.random.randn(8)
    }
)

In [94]:
df

     A      B         C         D
0  foo    one  0.916270 -1.649492
1  bar    one  0.119248 -0.156231
2  foo    two -1.402275  0.007685
3  bar  three -0.530516  0.522401
4  foo    two  0.706309  0.288253
5  bar    two  0.913522 -0.466663
6  foo    one  0.754901  1.766256
7  bar  three  0.644909 -1.389378

In [102]:
a = df.groupby('B').sum()
a

              C         D
B
one    1.790418 -0.039468
three  0.114393 -0.866978
two    0.217556 -0.170724

In [106]:
a = df.groupby('A').sum()
a

            C         D
A
bar  1.147162 -1.489872
foo  0.975205  0.412702

In [108]:
a = df.groupby(['A', 'B']).sum()
a

                  C         D
A   B
bar one    0.119248 -0.156231
    three  0.114393 -0.866978
    two    0.913522 -0.466663
foo one    1.671171  0.116764
    two   -0.695966  0.295939

In [98]:
x = [1, 2, 3]
y = [4, 5, 6]
zipped = zip(x,y)
list(zipped)

[(1, 4), (2, 5), (3, 6)]

In [99]:
x2, y2 = zip(*zip(x,y))

In [100]:
x2

(1, 2, 3)

In [101]:
y2

(4, 5, 6)

In [109]:
df = pd.DataFrame(
    {
        'A' : ['one', 'one', 'two', 'three'] * 3,
        'B' : ['A', 'B', 'C'] * 4,
        'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar' ] * 2,
        'D' : np.random.randn(12),
        'E' : np.random.randn(12)
    }
)

In [110]:
df

        A  B    C         D         E
0     one  A  foo -0.282389 -1.605483
1     one  B  foo  1.281657  0.970391
2     two  C  foo  0.038381  0.679042
3   three  A  bar  1.047916 -1.736862
4     one  B  bar -0.823207  0.343642
5     one  C  bar -0.644853 -0.389497
6     two  A  foo -0.000312 -0.018381
7   three  B  foo -1.510826 -0.450447
8     one  C  foo -0.889919 -0.480481
9     one  A  bar  1.060311 -0.702409
10    two  B  bar  2.019486 -0.367910
11  three  C  bar -0.951634  0.612749

In [111]:
pd.pivot_table(df, values = 'D', index = ['A', 'B'], columns = ['C'])

C             bar       foo
A     B
one   A  1.060311 -0.282389
      B -0.823207  1.281657
      C -0.644853 -0.889919
three A  1.047916       NaN
      B       NaN -1.510826
      C -0.951634       NaN
two   A       NaN -0.000312
      B  2.019486       NaN
      C       NaN  0.038381